阅读方法

	本书共分为十章，每一章都是一个专题，专门讲解一类算法问题。每一章中又划分多个小节，
专门讲解这类算法中的某一分支。
	同一章节中的算法会有明显的联系，我把较为简单基础的算法安排在前面，较复杂的算法安排
在后面。很多章节中的复杂算法会使用之前已经实现的基础算法，本书的代码不会重复之前的工作
，而是尽量直接调用。
	我推荐读者阅读本书时挑选感兴趣的章节，不必顾及先后；但同一小节中的算法代码应当顺序
阅读，做到从基础到进阶的过程。
	本书的代码中使用了一些编程中通用的数据结构，我将其实现为头文件general_head.h，其中
包含C++运行所必须的依赖库，容器和一些本书算法中通用的宏。
	本书的一些章节出于需要使用了一些支持算法的自定义数据结构，我将它们实现为头文件
structure.h，这些头文件只对应于固定的章节，无法通用。比如图论一章中使用了邻接表和邻接
矩阵这样的自定义数据结构。
	在阅读学习本书的每个章节之前，请读者一定先阅读头文件，其中自定义的数据结构展现了该
章节中算法的精要所在，否则读者在阅读时会不知所云。
	本书的每一节最后我都会附上该小节中所有算法的测试用例，测试用例能够体现自定义数据结
构的使用方法(这些自定义数据结构本身也是非常易懂的)。读者只要在工作目录下包含通用头文件
general_head.h，该小节所需的头文件structure.h，算法代码algo.cpp和测试用例test.cpp，编
译运行即可看到算法运行效果。本书所有代码均通过G++编译运行。


西安交通大学计算机系
林荣彬
2014年2月16日
