//2-SAT问题
//_2_satisfiability.cpp

//一个长度为n的布尔值序列s，序列中第i位，第j位和第k位元素等等满足一些限制关系
//比如s[i] and s[j] = 0，s[i] or s[j] or s[k] = 1等约束
//当所有约束中只涉及至多两个元素，则称为2-SAT问题

//1)基础概念
//当约束中可以涉及任意多元素时，该问题扩展为一个NP完全问题
//而只有两个元素的约束最多有11种：
//s[i]					
//not s[i]
//s[i] and s[j]
//s[i] and (not s[j])
//s[i] or s[j]
//s[i] or (not s[j])
//not(s[i] and s[j])
//not(s[i] or s[j])
//s[i] xor s[j] (xor为异或运算，相同为0，相异为1)
//not(s[i] xor s[j])
//s[i] xor (not s[j])
//进一步由于
//s[i] and s[j] = (s[i]) and (s[j])，即第1种情况和第3种情况
//not(s[i] or s[j]) = (not s[i]) and (not s[j])，即第8种情况和第3种情况
//因此不同的约束关系共有9种
//
//2)原始解法
//将长度为n的序列s看作有n个节点的有向图，将其中每个节点i拆分成两个节点i1和i2
//节点i对应的节点i1指代s[i] = 1，节点i2指代s[i] = 0，即i1和i2指代了s[i]的两种状态
//s[i]必须选取节点i1和i2其中的一个，而不能两个都选或都不选
//序列s中的关系通过有向图中对应节点的边来指代：
//
//待续




